---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeCalculatedSize
source: html/a0753da4-077f-a6a3-4fc4-459025ba320d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeCalculatedSize Property

"Pipe Size"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeCalculatedSize { get; }
```